//
// Created by C2243829 on 2021/2/15.
//
# include <stdio.h>
int main()
{
    int sum = 0;

    for (int j = 3; j < 100; ++j)
    {
        if ( j%3 == 0)
        {
            sum += j;

        }

    }
    printf("%d", sum);
    return 0;
}

// 嵌套的for的执行顺序:
// for (1; 2; 3)
//        for (4; 5; 6)
//            A;
//            B;
// 执行顺序是: 1--> 2 --> 4 --> 5--> A --> 6 -->5 -->A --> 6 --> 5 -->
// 如果5条件不满足 --> 3 --> 2 --> 4--> 5 --> A --> 6 --> 5 --> A
// 当条件5 不满足的时候, 退回到上一级for;
// 当 条件2 也不满足的时候, 执行 B